<HTML>

<HEAD>
  <TITLE>
    Sur les nombres de Fermat et de Mersenne (&Eacute;douard Lucas)p.230-235
  </TITLE>
</HEAD>

<BODY bgcolor=white>


  <center>
    <table width=460>
      <tr>
        <td>
          <center>
            <img src="lucasImg/tomeIIf.gif" border=0 alt="R&eacute;cr&eacute;ations math&eacute;matiques
         (&Eacute;douard Lucas, tome II, 1883, Gauthier-Villars) p.230-235">
          </center>

          <hr size=1>
          <table width=100%>
            <tr>
              <td width=20% align=left>230</td>
              <td width=60% align=center><i>Notes.</i></td>
              <td width=20% align=right>&nbsp;</td>
            </tr>
          </table>
          <hr size=1>

          <br>
          <center>
            <font size=+1>
              NOTE II.
            </font>
          </center>

          <br>
          <center>
            <i>Sur les nombres de Fermat et de Mersenne.</i>
          </center>

          <br>&nbsp;&nbsp;&nbsp;
          Nous avons vu que le nombre des dispositions du jeu de parquet, pour un carr&eacute;
          form&eacute; de 64 carreaux, est &eacute;gal &agrave; la soixante-quatri&egrave;me
          puissance de 2.

          En diminuant ce nombre 2<sup>64</sup> de l'unit&eacute;, on obtient le nombre de grains
          de bl&eacute qui recouvriraient l'&eacute;chiquier, en supposant un grain de bl&eacute
          sur la premi&egrave;re case, deux sur la seconde, quatre sur la troisi&egrave;me, et
          ainsi en doublant jusqu'&agrave la soixante-quatri&egrave;me case.

          <a href="#BrisseNote1">
            Le nombre 2<sup>64</sup>-1 rentre dans les <I>nombres de Mersenne</I>
          </a>
          que nous avons consid&eacute;r&eacute;s

          <a href="#BrisseNote2">
            dans la note VI du Tome I</a>.

          Nous dirons, &agrave; ce propos, que M. Le Lasseur vient encore de trouver que les nombres

          <br><br>
          <center>
            2<sup>97</sup>-1,
            &nbsp;&nbsp;&nbsp;&nbsp;2<sup>211</sup>-1,
            &nbsp;&nbsp;&nbsp;&nbsp;2<sup>151</sup>-1,
            &nbsp;&nbsp;&nbsp;&nbsp;2<sup>223</sup>-1,
          </center>

          <br>
          sont respectivement divisibles par

          <br><br>
          <center>
            11447,
            &nbsp;&nbsp;&nbsp;&nbsp;15193,
            &nbsp;&nbsp;&nbsp;&nbsp;18121,
            &nbsp;&nbsp;&nbsp;&nbsp;18287,
          </center>

          <br>
          et de v&eacute;rifier que les autres nombres 2<sup><i>n</i></sup>-1 pour vingt-quatre
          valeurs de n premier jusqu'&agrave; 257, n'ont pas de diviseurs plus petits que 30&nbsp;000.

          Ces nouveaux calculs nous confirment dans cette opinion que Fermat et Mersenne
          poss&eacute;daient une puissante m&eacute;thode de d&eacute;composition ignor&eacute;
          e aujourd'hui, mais que nous pensons avoir reconstitu&eacute;e en grande partie.

          <br>&nbsp;&nbsp;&nbsp;
          Dans notre voyage &agrave; Rome, nous avons pu obtenir de la bienveillance et de la
          g&eacute;n&eacute;rosit&eacute; de son Excellence le prince B. Boncompagni, la
          communication de deux pr&eacute;cieux volumes de manuscrits contenant plus de quarante
          lettres in&eacute;dites de Fermat &agrave; Mersenne.

          Dans une lettre dat&eacute;e de Toulouse, le 7 avril 1643, on trouve le passage suivant:
          &laquo; Vous me demandez si le nombre

          <br><br>
          <center>100
            &nbsp;&nbsp;895
            &nbsp;&nbsp;598
            &nbsp;&nbsp;169</center>

          <br>
          est premier ou non, et une m&eacute;thode pour d&eacute;couvrir, dans l'espace d'un jour,
          s'il est premier ou compos&eacute;.

          A cette question, je r&eacute;ponds que ce nombre est compos&eacute; et se fait du produit
          de ces deux:

          <br><br>
          <center><a href="#BrisseNote3">898 423</a>
            &nbsp;&nbsp;&nbsp;&nbsp;et
            &nbsp;&nbsp;&nbsp;&nbsp;112 303,</center>

          <br>
          qui sont premiers.

          Je suis toujours, mon r&eacute;v&eacute;rend P&egrave;re, votre tr&egrave;s humble et
          tr&egrave;s affectionn&eacute; serviteur, F<font size=-2>ERMAT</font> &raquo;.

          Pour se rendre compte de l'efficacit&eacute; de cette m&eacute;thode, on observera
          d'abord qu'il n'existait pas alors de tables tr&egrave;s &eacute;tendues de nombres
          premiers, et que ces deux facteurs de six chiffres &eacute;taient en dehors des tables;
          mais on observera encore qu'il n'existe pas de

          <br>
          <hr size=1>
          <table width=100%>
            <tr>
              <td width=20% align=left>&nbsp;</td>
              <td width=60% align=center><i>Notes.</i></td>
              <td width=20% align=right>231</td>
            </tr>
          </table>
          <hr size=1>
          <br>

          m&eacute;thode
          connue
          pour d&eacute;composer rapidement en facteurs premiers des nombres de douze chiffres.

          Si nous comparons avec les m&eacute;thodes plus modernes, nous voyons Gauss, dans la
          sixi&egrave;me section des <i>Disquitiones arithmeticae</i>, proposant plusieurs
          m&eacute;thodes pour distinguer les nombres premiers des nombres compos&eacute;s, et
          pour d&eacute;composer ceux-ci en leurs facteurs premiers; c'est, ajoute Gauss,
          l'un des probl&egrave;mes les plus importants et les plus utiles de
          l'Arithm&eacute;tique(n&ordm; 329).

          Il prend pour exemple le nombre

          <br><br>
          <center>314 159 265</center>

          <br>
          qui se ram&egrave;ne imm&eacute;diatement, par la suppression des facteurs
          3<sup>2</sup>, 5, 7 &agrave; un nombre de six chiffres que l'on trouve dans les
          tables de Burckhardt:

          <br><br>
          <center>997 331 = 127 &times; 7853.</center>

          <br>&nbsp;&nbsp;&nbsp;
          Les m&eacute;thodes de Gauss seraient impuissantes &agrave; r&eacute;soudre le
          probl&egrave;me propos&eacute; par Mersenne &agrave; Fermat.

          <br>&nbsp;&nbsp;&nbsp;
          Si l'on ne parvient pas &agrave; la d&eacute;composition des nombres de Mersenne
          par l'emploi des diverses m&eacute;thodes connues actuellement, on v&eacute;rifie
          que ces nombres sont premiers par l'application du th&eacute;or&egrave;me suivant
          analogue au th&eacute;or&egrave;me de Wilson. <i>Pour que le nombre
            p=2<sup>4q+3</sup>-1 soit premier, il faut et il suffit que la congruence

            <br><br>
            <center><img src="lucasImg/formule1.gif" width=174 height=36 border=0 alt="congruence"></center>

            c'est-&agrave;-dire

            <br>
            <center><img src="lucasImg/formule2.gif" width=288 height=46 border=0 alt="equation"></center>

            soit v&eacute;rifi&eacute;e apr&egrave;s la disparition successive des radicaux.
          </i>

          <br>&nbsp;&nbsp;&nbsp;
          En d'autres termes, on forme la suite des nombres V<sub><i>n</i></sub>

          <br><br>
          <center>1, 3, 7, 47, 2207, ...</center>

          <br>
          tels que chacun d'eux, &agrave; partir du troisi&egrave;me, soit &eacute;gal au
          carr&eacute; du pr&eacute;c&eacute;dent diminu&eacute; de 2 unit&eacute;s; on supprime
          les multiples de <i>p</i>, et si le nombre de rang 4<i>q</i>+2 est nul, le nombre
          <i>p</i> est premier.

          Nous avons indiqu&eacute; un proc&eacute;d&eacute; de calcul qui repose sur l'emploi
          du syst&egrave;me de num&eacute;ration binaire et qui conduit &agrave; la construction
          d'un m&eacute;canisme propre &agrave; la v&eacute;rification des grands nombres premiers.

          <br>&nbsp;&nbsp;&nbsp;
          Dans ce syst&egrave;me, la multiplication consiste simplement dans le d&eacute;placement
          longitudinal du multiplicande; d'autre part, il est clair que le reste de la division
          de 2<sup><i>m</i></sup> par 2<sup><i>n</i></sup>-1 est &eacute;gal &agrave;
          2<sup><i>r</i></sup>, <i>r</i> d&eacute;signant le reste de la

          <br><br>
          <hr size=1>
          <table width=100%>
            <tr>
              <td width=20% align=left>232</td>
              <td width=60% align=center><i>Notes.</i></td>
              <td width=20% align=right>&nbsp;</td>
            </tr>
          </table>
          <hr size=1>
          <br>


          division de <i>m</i>
          par <i>n</i>; par cons&eacute;quent, dans l'essai de 2<sup>31</sup>-1, par exemple, il
          suffira d'op&eacute;rer sur des nombres ayant au plus 31 des chiffres 0 ou 1.

          La <i>fig. 104</i> donne le calcul de
          V<sub>26</sub> d&eacute;duit du calcul de V<sub>25</sub> par la formule

          <br><br>
          <center><img src="lucasImg/formule3.gif" width=154 height=33 border=0 alt="congruence"></center>

          <br>
          les carr&eacute;s ombr&eacute;s repr&eacute;sentent les unit&eacute;s des
          diff&eacute;rents ordres du syst&egrave;me

          <br><br>
          <center>Fig. 104.</center>
          <br>
          <center>
            <img src="lucasImg/form104a.gif" width=287 height=388 border=0 alt="">
            <br>
            <img src="lucasImg/form104b.gif" width=284 height=77 border=0 alt="">
          </center>

          <br>
          binaire, et les carr&eacute;s blancs repr&eacute;sentent des z&eacute;ros.

          La premi&egrave;re ligne est le r&eacute;sidu V<sub>25</sub>; les 31 premi&egrave;res
          lignes num&eacute;rot&eacute;es de 0 &agrave; 30 figurent le carr&eacute; de
          V<sub>25</sub>; les quatre lignes num&eacute;rot&eacute;es 0, 1, 2, 3 au bas de la
          figure donnent l'addition des unit&eacute;s de chaque colonne, avec les reports; on
          a retranch&eacute; 2, ou l'unit&eacute; de la deuxi&egrave;me colonne &agrave; droite;
          enfin la derni&egrave;re ligne est le r&eacute;sidu de V<sub>26</sub>.

          <br><br>
          <hr size=1>
          <table width=100%>
            <tr>
              <td width=20% align=left>&nbsp;</td>
              <td width=60% align=center><i>Notes.</i></td>
              <td width=20% align=right>233</td>
            </tr>
          </table>
          <hr size=1>
          <br>
          &nbsp;&nbsp;&nbsp;
          La <i>fig.</i> 105 contient l'ensemble de tous les r&eacute;sidus de V<sub>1</sub>
          &agrave; V<sub>30</sub>; la derni&egrave;re ligne compos&eacute;e enti&egrave;rement
          de z&eacute;ros nous montre que 2<sup>31</sup>-1 est premier.

          <br>&nbsp;&nbsp;&nbsp;
          Pour la v&eacute;rification des nombres de Mersenne de la forme
          2<sup>4<i>q</i>+1</sup>-1, on calcule de la m&ecirc;me mani&egrave;re la s&eacute;rie

          <br><br>
          <center>4, 14, 194, 37 634,...</center>
          <br>
          <center>Fig. 105.</center>
          <br>
          <center><img src="lucasImg/form105.gif" width=288 height=398 border=0 alt=""></center>

          <br>
          On a encore le th&eacute;or&egrave;me wilsonien:
          <br>
          <i>Pour que <i>p</i> = 2<sup>4<i>n</i>q+2<i>n</i>+1</sup>-1 soit premier, il faut et
            il suffit que l'on ait</i>

          <br><br>
          <center><img src="lucasImg/formule4.gif" width=276 height=39 border=0 alt=""></center>

          <br>
          Fermat avait cru rencontrer dans l'expression

          <br><br>
          <center>F<sub><i>n</i></sub>= 2<sup>2<sup><i>n</i></sup></sup>+1,</center>

          <br>
          une formule ne donnant que des nombres premiers. Il &eacute;crivait &agrave; Mersenne,

          <br><br>
          <hr size=1>
          <table width=100%>
            <tr>
              <td width=20% align=left>234</td>
              <td width=60% align=center><i>Notes.</i></td>
              <td width=20% align=right>&nbsp;</td>
            </tr>
          </table>
          <hr size=1>
          <br>

          le 25 d&eacute;cembre 1640: &laquo; Si je puis une fois tenir la raison fondamentale que

          <br><br>
          <center>3, 5, 7, 17, 257, 65 537, ...,</center>
          <br>
          sont nombres premiers, il me semble que je trouverai de tr&egrave;s belles choses en
          cette mati&egrave;re, car j'ai d&eacute;j&agrave; trouv&eacute; des choses merveilleuses
          dont je vous ferai part &raquo;.

          Euler a signal&eacute; le premier l'inexactitude de sa conjecture de Fermat, en faisant
          voir que F<sub>5</sub> est divisible par 641.

          Par l'emploi d'une th&eacute;orie indiqu&eacute;e par Fermat lui-m&ecirc;me, Euler avait
          d&eacute;montr&eacute; ce th&eacute;r&egrave;me:

          <i>Les diviseurs premiers de 2<sup>4<i>q</i></sup>+1 sont de la forme lin&eacute;aire
            8<i>hq</i>+1</i>.

          Dans l'exemple, il suffit d'essayer la division de F<sub>5</sub> par les nombres

          <br><br>
          <center>193, 257, 449, 577, 641,</center>

          <br>
          et l'on trouve avec Euler

          <br><br>
          <center>F<sub>5</sub> = 641 &times; 6 700 417.</center>

          <br>&nbsp;&nbsp;&nbsp;
          Nous avons d&eacute;montr&eacute; (<i>Acad&eacute;mie de Turin</i>, 27 janvier 1878),
          que les <i>diviseurs premiers de 2<sup>4<i>q</i></sup>+1 sont de la forme 16<i>hq</i>+1</i>.

          L'emploi de ce th&eacute;or&egrave;me simplifie, de plus de moiti&eacute;, la recherche
          des diviseurs, et ainsi dans l'exemple, il est inutile d'essayer la division avec Euler
          et avec
          <a href="#LucasNote1">M. Tchebychef (<sup>1</sup>)</a>,
          par les quatre premiers nombres 193, 257, 449 et 577.

          <br>&nbsp;&nbsp;&nbsp;
          De m&ecirc;me, le premier diviseur qui se pr&eacute;sente pour F<sub>12</sub> est
          7&middot;2<sup>14</sup>+1 ou 114 689; l'essai r&eacute;ussit et l'on en conclut que
          F<sub>12</sub> n'est pas premier.

          De m&ecirc;me encore, le premier diviseur &agrave; essayer pour F<sub>23</sub> est
          5&middot;2<sup>25</sup>+1 ou 167 772 161, et M. Pervouchine, pope du gouvernement de Perm,
          a v&eacute;rifi&eacute; que le nombre F<sub>23</sub>, qui est form&eacute; de
          2 525 223 chiffres est encore un nombre compos&eacute;.

          Tous ces r&eacute;sultats se v&eacute;rifient en peu de temps, en calculant par congruences.

          <br>&nbsp;&nbsp;&nbsp;
          Pour reconna&icirc;tre si un nombre F<sub><i>n</i></sub> est premier, on forme la
          s&eacute;rie

          <br><br>
          <center>6, 34, 1154,...,</center>

          <br>
          tels que chacun d'eux est &eacute;gal au carr&eacute; du pr&eacute;c&eacute;dent
          moins deux, en supprimant les multiples de F<sub><i>n</i></sub>; pour que
          F<sub><i>n</i></sub> soit premier, il faut que le r&eacute;sidu de rang
          2<sup><i>n</i></sup>-1 soit nul.

          Nous avons fait le calcul pour n=6, et reconnu par ce moyen que le nombre
          2<sup>64</sup>+1, de vingt chiffres, est compos&eacute; (<i>Journal de Sylvester</i>,
          T. II, p. 238).

          En profitant de cette assertion

          <br><br><br>
          <a name="LucasNote1">(<sup>1</sup>)</a>
          <b>T<font size=-2>CHEBYCHEF</font></b>. <i>Th&eacute;orie des nombres</i>,
          (en langue russe, p. 182). - Saint-P&eacute;tersbourg, 1849. -
          <b>L<font size=-2>EBESGUE</font></b>.
          <i>Exercices d'Analyse num&eacute;rique</i>. p. 94. - Paris, 1859.

          <br><br>
          <hr size=1>
          <table width=100%>
            <tr>
              <td width=20% align=left>&nbsp;</td>
              <td width=60% align=center><i>Notes.</i></td>
              <td width=20% align=right>235</td>
            </tr>
          </table>
          <hr size=1>
          <br>


          et de la simplification que nous avons
          indiqu&eacute;e ci-dessus, pour la recherche des diviseurs, M. Landry a obtenu,
          &agrave; l'&acirc;ge de 82 ans, apr&egrave;s un labeur de plusieurs mois,
          le r&eacute;sultat suivant

          <br><br>
          <center>2<sup>64</sup>+1 = 274 177 &times; 67 280 421 310 721,</center>

          <br>
          que l'on peut v&eacute;rifier maintenant en quelques minutes.


          D'ailleurs, MM. Landry et Le Lasseur ont d&eacute;montr&eacute;,
          s&eacute;par&eacute;ment, que le second facteur est un nombre premier.

          <br>&nbsp;&nbsp;&nbsp;
          Nous ajouterons que pour modifier la conjecture de Fermat, on a
          &eacute;nonc&eacute; cette proposition:&laquo; Tous les nombres et les seuls
          nombres premiers qui surpassent de l'unit&eacute; les puissances de deux,
          sont ceux de la suite

          <br>
          <center><img src="lucasImg/formule5.gif" width=276 height=39 border=0 alt="">&raquo;</center>

          <br>
          D'autre part, Eisenstein a &eacute;nonc&eacute; ce th&eacute;or&egrave;me dont
          il poss&eacute;dait peut-&ecirc;tre la d&eacute;monstration: &laquo;<i>Il y a une
            infinit&eacute; de nombres premiers de la forme
            2<sup>2<sup><i>n</i></sup></sup> + 1;</i> &raquo;
          on ne conna&icirc;t actuellement aucune d&eacute;monstration de ces deux
          propositions encore inaccessibles.


          <br><br>
          <center><img src="lucasImg/fin.gif" border=0 alt=""></center>

        </td>
      </tr>
    </table>
  </center>

  <hr>
  <b>
    <font size=+1>Notes du transcripteur</font>
  </b>
  <br><br>
  <a name="BrisseNote1">Dans</a>
  le texte italique, &quot;2<sup>64</sup>-1 rentre dans les <i>nombres
    de Mersenne</i>&quot;, Lucas semble bien consid&eacute;rer qu'un nombre de Mersenne est de
  la forme 2<sup><i>n</i></sup>-1, que <i>n</i> soit premier ou non.

  <br><br>
  <a name="BrisseNote2">La</a>
  &quot;note VI&quot; est incorrectement indiqu&eacute;e &quot;note IV&quot;.

  <br><br>
  <a name="BrisseNote3">898</a>
  423 = 8 &times; 112 303 - 1
</BODY>

</HTML>